#define _CRT_SECURE_NO_WARNINGS
#include <iostream>
#include "classstary.h"
#include <conio.h>
#include <vector>
#include <string>
#include <random>
#include <cstdlib>
#include <algorithm>
#include <iomanip>
#include <windows.h>
int main()
{
	setlocale(LC_ALL, "rus");
	int e{};
	int zayaccount{ 1 };
	int money{ 100 };
	int corm{ 0 };
	int gold1{ 20 };
	int gold2{ 20 };
	int gold3{ 20 };
	int gold4{ 20 };

	int hardcore{0};
	std::cout << "Игра сделана BY Trox" << std::endl;
	std::cout << "выберите уровень сложности(чем больше число тем тяжелее игра):" << std::endl;
	last();
	second();
	secondtwo();
	first();
	std::cin >> hardcore;
	int goldtotal1{ gold1 * hardcore };
	std::cout << R"(________v__________________________________________
		______¶¶¶_______¶¶q________________________________
		______¶¶¶_______¶¶¶________________________________
		_____¶¶¶¶$_____¶¶¶¶________________________________
		_____¶¶¶¶¶_____¶¶¶¶¶_______________________________
		______¶¶¶¶_____¶¶¶¶________________________________
		______v¶¶¶q–__¶¶¶¶¶________________________________
		_______¶¶¶¶___¶¶¶¶¶________________________________
		_______¶¶¶¶¶__¶¶¶¶_________________________________
		________¶¶¶¶_¶¶¶¶$_________________________________
		________¶¶¶¶_¶¶¶¶__________________________________
		_________¶¶¶¶¶¶¶_________________¶¶v_______________
		_________¶¶¶¶¶¶¶_______________¶¶¶¶¶o______________
		_________¶¶¶¶¶¶_______________¶¶¶¶¶¶¶¶o____________
		__________¶¶¶¶¶__________–3¶¶¶¶¶¶¶¶¶¶¶¶¶___________
		__________¶¶¶¶q________–¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶_________
		____________¶–____v¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶_______
		__________o¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶_____
		__________¶¶_¶¶____¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶$___
		_________¶¶¶_¶¶3__¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶_
		_________¶¶¶_¶¶¶_¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶_
		________¶¶¶¶_¶¶¶v__¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶3__
		________¶¶¶¶_¶¶¶¶––¶¶¶qov_¶¶¶¶_______$¶¶$_vq$¶¶¶q__
		_______–¶¶¶¶__¶¶¶¶_¶$88oo_¶¶¶¶_______8¶¶8_qq3$¶¶o__
		_______¶¶¶¶___¶¶¶¶_¶883qv________________–vo38¶¶o__
		_______¶¶¶¶___¶¶¶¶¶¶$83qv________________–vo38¶¶o__
		______¶¶¶¶_____¶¶¶¶¶¶83qv________________–vo38¶¶o__
		_____¶¶¶¶¶_____¶¶¶¶¶¶83qv________________–vo38¶¶o__
		_____¶¶¶¶¶_____8¶¶¶¶883qv________________–vo38¶¶o__
		____–¶¶¶¶_______¶¶¶¶¶83qv________________–vo38¶¶o__
		____¶¶¶¶¶_______¶¶¶¶¶83qv________________–vo38¶¶o__
		____¶¶¶¶¶_______o¶¶¶¶83qv______________¶¶¶–o38¶¶o__
		_____¶¶¶_________¶¶¶$83qv______________¶¶¶vo38¶¶o__
		_____¶8¶__________¶¶¶83qv________________–oo38¶¶o__
		___________________¶$83qv______________q¶$–o38¶¶o__
		___________________¶¶83qv_____________¶¶¶¶¶o38¶¶o__
		___________________¶¶83qv_____________¶¶¶¶¶o38¶¶o__
		__________________–¶¶83ov_____________¶¶¶¶¶o3¶¶¶o__
		___________________¶¶33qv_____________¶¶¶¶¶o3$¶$v__)" << std::endl;
	std::cout << R"(Солнце безжалостно палит, обжигая кожу. Вы очнулись в тёмной сырой клетке,
 ваши конечности скованы цепями. Голова раскалывается, напоминая о вчерашнем поражении в бою. 
Вокруг смех и голоса ваших похитителей, грубых наёмников, промышляющих в этих диких землях. 
Главный из них с гнилым оскалом подходит к вашей клетке.
 «Тебя продадут в рабство, — цедит он сквозь зубы, — или же… ты можешь выкупить свою свободу.
 Пять тысяч золотых монет — и ты свободен».
 В глазах наёмника нет ни капли милосердия. Вам остаётся только одно — доказать, что вы достойны свободы.)" << std::endl;
	//std::cout << time(nullptr) << std::endl;

	while (TRUE) {
		menu();
		std::cin >> e;
		clearScreen();
		switch (e)
		{
		default:
			break;
		case 1:
			game1(corm, zayaccount, money, gold1, gold2, hardcore);
			clearScreen();
			break;
		case 2:
			runRabbitSystem(zayaccount, gold1, hardcore);
			break;
		}
	}

}
